lisp/clbe/clbe-16.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Structures</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Structures</h1>
<p>
Previous: <a href="clbe-15.html">15. Hash Tables</a>
</p>

<p>
Next: <a href="clbe-17.html">17. Reading &amp; Writing to Files</a>
</p>

<p>
Common Lisp provides the DEFSTRUCT facility for creating named data
structures with named components. This makes it easier to manipulate
custom data objects as we can refer to their components by
name. Constructor, access and assignment constructs are automatically
defined when a data type is defined through DEFSTRUCT.
</p>

<p>
Consider the below example of defining a data type for
rectangles. DEFSTRUCT defines RECTANGLE to be a structure with two
fields, height and width. The symbol RECTANGLE becomes the name of a
data type and each rectangle will be of type RECTANGLE, then
STRUCTURE, then ATOM and then T. DEFSTRUCT generates four associated
functions:
</p>

<ol class="org-ol">
<li>RECTANGLE-HEIGHT and RECTANGLE-WIDTH to access elements of the
structure</li>

<li>RECTANGLE-P to test whether an object is of type rectangle</li>

<li>MAKE-RECTANGLE to create rectangles</li>

<li>COPY-RECTANGLE to create copies of rectangles</li>
</ol>

<div id="outline-container-org0f9d7de" class="outline-2">
<h2 id="org0f9d7de">Example of a Structure</h2>
<div class="outline-text-2" id="text-org0f9d7de">
<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Height will default to NIL</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Width will default to 5 </span>

(<span style="color: #a020f0;">defstruct</span> <span style="color: #228b22;">rectangle</span> (height)
           (width 5))

(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">rectangle-1</span>)

(setf rectangle-1
      (make-rectangle <span style="color: #483d8b;">:height</span> 10 <span style="color: #483d8b;">:width</span> 15))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns 10</span>

(rectangle-height rectangle-1)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns 20</span>

(setf (rectangle-width rectangle-1) 20)

(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">rectangle-2</span>)

(setf rectangle-2 (make-rectangle))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Prints #S(RECTANGLE :HEIGHT NIL :WIDTH 5)</span>

rectangle-2

</pre>
</div>

<p>
There are some advanced initialization options that we will not
discuss here. Note that the the #S syntax can be used to read
instances of rectangle structures.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
